/*********************************************************************/
/*     Program: PDS9UPR                                              */
/*       Title: Generic program to execute an open query command     */
/*        Date: 09/16/98                                             */
/* Description: - Execute an open query command.                     */
/*                                                                   */
/*  Parameters:                                                      */
/*  Usage   Field       Field Description                            */
/*  -----   ---------   ------------------------------------------   */
/*    I     &FILE       File to Build the Query Over                 */
/*    I     &QRYSLT     Query Selection Field                        */
/*                                                                   */
/*********************************************************************/
/* Modifications:                                                    */
/*                                                                   */
/*   Date     Pgmr     Description                                   */
/* -------- ---------- --------------------------------------------  */
/* PIO 10/28/24 REPLACE OPNQRYF WITH OPNSQLF IN OPBFCPM6 FILE        */
/*              ADDED NEEDED OVRDBF AROUND THE COMMAND               */
/*              CHANGE *AND TO AND, *EQ TO =, *GE TO >=, *LE TO <=   */
/*              *GT TO > IN &E                                       */
/*                                                                   */
/*********************************************************************/
             PGM        PARM(&FILE &QRYSLT)

   /*-------------------*/
   /* Declare Variables */
   /*-------------------*/

             /* Parameter Fields */
             DCL  VAR(&FILE)   TYPE(*CHAR) LEN(10)
             DCL  VAR(&QRYSLT) TYPE(*CHAR) LEN(200)

   /*--------------------------------*/
   /* Execute the Open Query Command */
   /*--------------------------------*/
   /*PIO*/   IF         COND(&FILE *NE 'OPBFCPM6') THEN(DO)
             OVRDBF FILE(&FILE) OVRSCOPE(*JOB) SHARE(*YES)
             OPNQRYF FILE((&FILE)) QRYSLT(&QRYSLT) KEYFLD(*FILE)
   /*PIO*/   ENDDO

   /*PIO*/   ELSE DO
   /*PIO*/   OVRDBF     FILE(OPBFCPP) TOFILE(OPBFCPP) LVLCHK(*NO)
   /*PIO*/   OPNSQLF    SQL('SELECT * FROM OPBFCPP WHERE  ' *BCAT +
                          &QRYSLT *BCAT ' ORDER BY BEANC7 ASC, +
                          BERMNB ASC, BEC4NB ASC') OPNID(OPBFCPM6) +
                          OPTION(*ALL) SEQONLY(*NO) RCDFMT(@BFCPYI) +
                          ALWCPY(*IFRQD)
   /*PIO*/   OVRDBF     FILE(OPBFCPM6) TOFILE(OPBFCPP) LVLCHK(*NO) +
                           OVRSCOPE(*JOB) SHARE(*YES) OPNSCOPE(*JOB)
   /*PIO*/   ENDDO

 ENDPGM:
             ENDPGM
